package com.prgrms.modi.utils;

import java.util.Arrays;
import java.util.List;
import java.util.Random;

public class UsernameGenerator {

    private static final List<String> adjectives = Arrays.asList(
        "가냘픈", "가는", "가엾은", "가파른", "같은", "거센", "거친", "검은", "게으른", "게을러빠진",
        "게을러터진", "고달픈", "고른", "고마운", "고운", "고픈", "곧은", "괜찮은", "구석진", "굳은",
        "굵은", "귀여운", "그런", "그른", "그리운", "기다란", "기쁜", "긴", "깊은", "깎아지른",
        "깨끗한", "나쁜", "나은", "난데없는", "날랜", "날카로운", "낮은", "너그러운", "너른", "널따란",
        "넓은", "네모난", "노란", "높은", "누런", "눅은", "느닷없는", "느린", "늦은", "다른",
        "더러운", "더운", "덜된", "동그란", "돼먹잖은", "된", "둥그런", "둥근", "뒤늦은", "드문",
        "딱한", "때늦은", "뛰어난", "뜨거운", "막다른", "많은", "매운", "먼", "멋진", "메마른",
        "메스꺼운", "모난", "못난", "못된", "못생긴", "무거운", "무딘", "무른", "무서운", "미끈미끈한",
        "미운", "바람직스러운", "반가운", "밝은", "밤늦은", "보드라운", "보람찬", "보잘것없는", "부드러운", "부른",
        "붉은", "비싼", "빠른", "빨간", "뻘건", "뼈저린", "뽀얀", "뿌연", "새로운", "섣부른",
        "설운", "성가신", "센", "수다스러운", "수줍은", "쉬운", "스스러운", "슬픈", "시원찮은", "싫은",
        "싼", "쌀쌀맞은", "쏜살같은", "쓰디쓴", "쓰린", "쓴", "아니꼬운", "아닌", "아름다운", "아쉬운",
        "아픈", "안된", "안쓰러운", "안타까운", "않은", "알맞은", "약빠른", "약은", "얇은", "얕은",
        "어두운", "어려운", "어린", "언짢은", "엄청난", "없는", "여문", "열띤", "예쁜", "올바른",
        "옳은", "외로운", "우스운", "의심쩍은", "이른", "익은", "있는", "작은", "잘난", "잘빠진",
        "잘생긴", "재미있는", "적은", "젊은", "점잖은", "조그만", "좁은", "좋은", "주제넘은", "줄기찬",
        "즐거운", "지나친", "지혜로운", "질긴", "짓궂은", "짙은", "짠", "짧은", "케케묵은", "큰",
        "탐스러운", "턱없는", "푸른", "하나같은", "한결같은", "흐린", "희망찬", "흰", "힘겨운", "힘찬"
    );

    private static final List<String> nouns = Arrays.asList(
        "캥거루", "토끼", "강아지", "고양이", "코알라", "고릴라", "원숭이", "고래", "낙타", "뱀",
        "물개", "쥐", "소", "말", "돼지", "거북이", "악어", "호랑이", "표범", "치타",
        "늑대", "여우", "스컹크", "두더지", "돌고래", "도마뱀", "독소리", "바다표범", "가재", "랍스타",
        "원앙", "까마귀", "오리", "앵무새", "부엉이", "참새", "꾀꼬리", "나비", "잠자리", "이구아나",
        "카멜레온", "개미핥기", "거미", "잉어", "곰", "펭귄", "거위", "오솔개", "누에", "아나콘다",
        "박쥐", "병아리", "닭", "멧돼지", "갈매기", "코뿔소", "사슴", "코끼리", "하마", "남생이",
        "다람쥐", "가오리", "미어캣", "코브라", "자라", "두꺼비", "까치", "복어", "문어", "사자",
        "오징어", "쭈꾸미", "해파리", "오리너구리", "너구리", "양", "꿩", "개구리", "낙지", "제비",
        "메추라기", "살모사", "매미", "하늘소", "매", "망둥어", "말똥구리", "벌", "산양", "뻐꾸기",
        "비둘기", "풍뎅이", "산양", "딱따구리", "등에", "두루미", "달팽이", "다슬기", "노루"
    );

    public static String createRandomName() {
        Random random = new Random();
        String adjective = adjectives.get(random.nextInt(adjectives.size()));
        String noun = nouns.get(random.nextInt(nouns.size()));
        return adjective + " " + noun;
    }

}
